Revit 2027 API
ViewShapeBuilder.ValidateViewType Method
 Validates the incoming view type. As of today, the only allowed view type is Plan.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool ValidateViewType(
	DirectShapeTargetViewType targetViewType
)
Public Shared Function ValidateViewType (
	targetViewType As DirectShapeTargetViewType
) As Boolean
public:
static bool ValidateViewType(
	DirectShapeTargetViewType targetViewType
)
static member ValidateViewType :
        targetViewType : DirectShapeTargetViewType -> bool
Parameters
targetViewType DirectShapeTargetViewType
Return Value
Boolean
 True if %targetViewType% is DirectShapeTargetViewType::Plan
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ViewShapeBuilder Class
Autodesk.Revit.DB Namespace